Revit 2024 API
TessellatedShapeBuilder Methods
The TessellatedShapeBuilder type exposes the following members.
Methods
Name | Description
AddFace
 Adds a face to the currently open connected face set.
AreTargetAndFallbackCompatible
 Checks whether this combination of fallback and target parameters can be used as a valid combination of inputs.
Build
 Builds the designated geometrical objects from the stored face sets. Stores the result in this TessellatedShapeBuilder object.
CancelConnectedFaceSet
 Cancels the current face set - i.e., all data from it will be lost and the builder will have no open connected face set anymore.
Clear
 Erases all face set and clears the logs, if any.
CloseConnectedFaceSet
 Closes the currently open connected face set.
CreateMeshByExtrusion
 Builds a mesh by extruding curve loop(s) along extrusion distance.
Dispose |  (Inherited from ShapeBuilder.)
DoesFaceHaveEnoughLoopsAndVertices
 Checks whether 'face' has enough loops and vertcies to be valid.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBuildResult
 Get the built geometry, build status and other data stored in TessellatedShapeBuilderResult. Clears the stored data.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
OpenConnectedFaceSet
 Opens a new connected face set.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace